src/test/resources/mockdata/compositeOrders/1ab7ef6a-d1d4-4a4f-90a2-882aed18af14.json

{
  "id": "1ab7ef6a-d1d4-4a4f-90a2-882aed18af14",
  "adjustment": {
    "credit": 0.0,
    "discount": 0.0,
    "insurance": 0.0,
    "overhead": 0.0,
    "shipment": 0.0,
    "tax1": 0.0,
    "tax2": 0.0,
    "useProRate": false
  },
  "approved": true,
  "assignedTo": "",
  "manualPo": false,
  "notes": [],
  "poNumber": "268758",
  "orderType": "One-Time",
  "reEncumber": false,
  "totalEstimatedPrice": 127.94,
  "totalItems": 3,
  "vendor": "50fb88ea-cdf1-11e8-a8d5-f2801f1b9fd1",
  "workflowStatus": "Pending",
  "metadata": {
    "createdDate": "2018-06-29T00:00:00.000",
    "createdByUserId": "28d0f99c-d137-11e8-a8d5-f2801f1b9fd1"
  },
  "compositePoLines": [
    {
      "id": "50fb4bfa-cdf1-11e8-a8d5-f2801f1b9fd1",
      "acquisitionMethod": "Purchase",
      "adjustment": {
        "credit": 0.0,
        "discount": 0.0,
        "insurance": 0.0,
        "invoiceId": "2d6d495c-c237-476f-aa48-50f7cbf74ca4",
        "overhead": 0.0,
        "shipment": 0.0,
        "tax1": 0.0,
        "tax2": 0.0,
        "useProRate": false
      },
      "alerts": [],
      "cancellationRestriction": false,
      "cancellationRestrictionNote": "",
      "claims": [
        {
          "claimed": false,
          "grace": 90
        }
      ],
      "collection": false,
      "contributors": [
        {
          "contributor": "Steinar Imsen (ed.)",
          "contributorType": "fbdd42a8-e47d-4694-b448-cc571d1b44c3"
        }
      ],
      "cost": {
        "listPrice": 68.00,
        "currency": "USD",
        "quantityPhysical": 1,
        "quantityElectronic": 0,
        "poLineEstimatedPrice": 68.00
      },
      "description": "",
      "details": {
        "receivingNote": "",
        "productIds": [
          {
            "productId": "10407849",
            "productIdType": "Vendor Item Number"
          }
        ],
        "materialTypes": [
          "fde2dc42-cde3-11e8-a8d5-f2801f1b9fd1"
        ],
        "subscriptionFrom": null,
        "subscriptionInterval": 0,
        "subscriptionTo": null
      },
      "donor": "",
      "eresource": {
        "activated": false,
        "activationDue": 0,
        "createInventory": false,
        "trial": false,
        "expectedActivation": null,
        "userLimit": 0,
        "accessProvider": null,
        "license": "07c5d8be-cabe-11e8-a8d5-f2801f1b9fd1"
      },
      "fundDistribution": [
        {
          "code": "EUROHIST-FY19",
          "percentage": 100.0,
          "encumbrance": "eb506834-6c70-4239-8d1a-6414a5b08003"
        }
      ],
      "locations": [
        {
          "locationId": "07c5d9ea-cabe-11e8-a8d5-f2901f1b9fd1",
          "quantity": 1,
          "quantityElectronic": 0,
          "quantityPhysical": 1
        }
      ],
      "orderFormat": "Physical Resource",
      "owner": "LTS Acquisitions",
      "paymentStatus": "Awaiting Payment",
      "physical": {
        "materialSupplier": "",
        "receiptDue": "2018-09-29T00:00:00.000Z",
        "volumes": [
          "vol. 1"
        ]
      },
      "poLineDescription": "",
      "poLineNumber": "268758-01",
      "publicationDate": "2011",
      "publisher": "Tapir Academic Press",
      "purchaseOrderId": "d79b2bcc-DcAD-1E4E-Abb7-DbFcaD5BB3bb",
      "receiptDate": null,
      "receiptStatus": "Awaiting Receipt",
      "reportingCodes": [],
      "requester": "",
      "rush": false,
      "selector": "Stevens",
      "source": {
        "code": "FOLIO",
        "description": "Manually entered"
      },
      "tags": [],
      "title": "Taxes, tributes and tributary lands in the making of Scandinavian kingdoms in the Middle Ages",
      "vendorDetail": {
        "instructions": "",
        "noteFromVendor": "",
        "vendorAccount": ""
      },
      "metadata": {
        "createdDate": "2018-06-29T00:00:00.000",
        "createdByUserId": "28d0f99c-d137-11e8-a8d5-f2801f1b9fd1"
      }
    },
    {
      "id": "50fb4e66-cdf1-11e8-a8d5-f2801f1b9fd2",
      "acquisitionMethod": "Purchase",
      "adjustment": {
        "credit": 0.0,
        "discount": 0.0,
        "insurance": 0.0,
        "invoiceId": "3d6d495c-c237-476f-aa48-50f7cbf74ca4",
        "overhead": 0.0,
        "shipment": 0.0,
        "tax1": 0.0,
        "tax2": 0.0,
        "useProRate": false
      },
      "alerts": [],
      "cancellationRestriction": false,
      "cancellationRestrictionNote": "",
      "claims": [
        {
          "claimed": false,
          "grace": 90
        }
      ],
      "collection": false,
      "contributors": [
        {
          "contributor": "Steinar Imsen (ed.)",
          "contributorType": "fbdd42a8-e47d-4694-b448-cc571d1b44c3"
        }
      ],
      "cost": {
        "listPrice": 34.95,
        "currency": "USD",
        "quantityPhysical": 1,
        "quantityElectronic": 0,
        "poLineEstimatedPrice": 34.95
      },
      "description": "",
      "details": {
        "receivingNote": "",
        "productIds": [
          {
            "productId": "9780820350790",
            "productIdType": "ISBN"
          }
        ],
        "materialTypes": [
          "fde2dc42-cde3-11e8-a8d5-f2801f1b9fd1"
        ],
        "subscriptionFrom": null,
        "subscriptionInterval": 0,
        "subscriptionTo": null
      },
      "donor": "",
      "eresource": {
        "activated": false,
        "activationDue": 0,
        "createInventory": false,
        "trial": false,
        "expectedActivation": null,
        "userLimit": 0,
        "accessProvider": null,
        "license": "07cvd8be-cabe-11e8-a8d5-f2801f1b9fd1"
      },
      "fundDistribution": [
        {
          "code": "USHIST-FY19",
          "percentage": 100.0,
          "encumbrance": "eb506834-6c70-4239-8d1a-6414a5b08004"
        }
      ],
      "locations": [
        {
          "locationId": "07c5d9ea-cabe-11e8-a8d5-f5901f1b9fd1",
          "quantity": 1,
          "quantityElectronic": 0,
          "quantityPhysical": 1
        }
      ],
      "orderFormat": "Physical Resource",
      "owner": "LTS Acquisitions",
      "paymentStatus": "Awaiting Payment",
      "physical": {
        "materialSupplier": "",
        "receiptDue": "2018-09-29T00:00:00.000Z",
        "volumes": [
          "vol. 1"
        ]
      },
      "poLineDescription": "",
      "poLineNumber": "268758-02",
      "publicationDate": "2011",
      "publisher": "Tapir Academic Press",
      "purchaseOrderId": "d75b0bcc-DcAD-1E4E-Abb7-DbFcaD5BB3bb",
      "receiptDate": null,
      "receiptStatus": "Awaiting Receipt",
      "reportingCodes": [],
      "requester": "",
      "rush": false,
      "selector": "Brown",
      "source": {
        "code": "FOLIO",
        "description": "Manually entered"
      },
      "tags": [],
      "title": "Alabama Women: Their Lives and Times",
      "vendorDetail": {
        "instructions": "",
        "noteFromVendor": "",
        "vendorAccount": ""
      },
      "metadata": {
        "createdDate": "2018-06-29T00:00:00.000",
        "createdByUserId": "28d0f99c-d137-11e8-a8d5-f2801f1b9fd1"
      }
    },
    {
      "id": "50fb5168-cdf1-11e8-a8d5-f2801f1b9fd3",
      "acquisitionMethod": "Purchase",
      "adjustment": {
        "credit": 0.0,
        "discount": 0.0,
        "insurance": 0.0,
        "invoiceId": "366d495c-c237-476f-aa48-50f7cbf74ca4",
        "overhead": 0.0,
        "shipment": 0.0,
        "tax1": 0.0,
        "tax2": 0.0,
        "useProRate": false
      },
      "alerts": [],
      "cancellationRestriction": false,
      "cancellationRestrictionNote": "",
      "claims": [
        {
          "claimed": false,
          "grace": 90
        }
      ],
      "collection": false,
      "contributors": [
        {
          "contributor": "Steinar Imsen (ed.)",
          "contributorType": "fbdd42a8-e47d-4694-b448-cc571d1b44c3"
        }
      ],
      "cost": {
        "listPrice": 24.99,
        "currency": "USD",
        "quantityPhysical": 1,
        "quantityElectronic": 0,
        "poLineEstimatedPrice": 24.99
      },
      "description": "",
      "details": {
        "receivingNote": "",
        "productIds": [
          {
            "productId": "9780764354113",
            "productIdType": "ISBN"
          }
        ],
        "materialTypes": [
          "fde2dc42-cde3-11e8-a8d5-f2801f1b9fd1"
        ],
        "subscriptionFrom": null,
        "subscriptionInterval": 0,
        "subscriptionTo": null
      },
      "donor": "",
      "eresource": {
        "activated": false,
        "activationDue": 0,
        "createInventory": false,
        "trial": false,
        "expectedActivation": null,
        "userLimit": 0,
        "accessProvider": null,
        "license": "07c5d8bv-cabe-11e8-a8d5-f2801f1b9fd1"
      },
      "fundDistribution": [
        {
          "code": "USHIST-FY19",
          "percentage": 100.0,
          "encumbrance": "eb506834-6c70-4239-8d1a-6414a5b08005"
        }
      ],
      "locations": [
        {
          "locationId": "07cvd9ea-cabe-11e8-a8d5-f2901f1b9fd1",
          "quantity": 1,
          "quantityElectronic": 0,
          "quantityPhysical": 1
        }
      ],
      "orderFormat": "Physical Resource",
      "owner": "LTS Acquisitions",
      "paymentStatus": "Awaiting Payment",
      "physical": {
        "materialSupplier": "",
        "receiptDue": "2018-09-29T00:00:00.000Z",
        "volumes": [
          "vol. 1"
        ]
      },
      "poLineDescription": "",
      "poLineNumber": "268758-03",
      "publicationDate": "2011",
      "publisher": "Tapir Academic Press",
      "purchaseOrderId": "d79b0bcc-DcAD-1E4E-Abb7-DbFcaD5BB3bb",
      "receiptDate": null,
      "receiptStatus": "Awaiting Receipt",
      "reportingCodes": [],
      "requester": "",
      "rush": false,
      "selector": "Brown",
      "source": {
        "code": "FOLIO",
        "description": "Manually entered"
      },
      "tags": [],
      "title": "Kayak Fishing in the Northern Gulf Coast",
      "vendorDetail": {
        "instructions": "",
        "noteFromVendor": "",
        "vendorAccount": ""
      },
      "metadata": {
        "createdDate": "2018-06-29T00:00:00.000",
        "createdByUserId": "28d0f99c-d137-11e8-a8d5-f2801f1b9fd1"
      }
    }
  ]
}
